tutorials/multiphase/compressibleInterFoam/les/depthCharge3D/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;

method          hierarchical;
//method          metis;
//method          parMetis;

simpleCoeffs
{
    n               (1 4 1);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (1 4 1);
    delta           0.001;
    order           xyz;
}

metisCoeffs
{}

manualCoeffs
{
    dataFile        "";
}

distributed     no;

roots
(
);

// ************************************************************************* //
